/********************************************************************
	创建日期:	2016/06/25
	文 件 名:	CommonTool
	扩 展 名:	h
	作    者:	zz
	
	说    明:	公共函数实现文件
*********************************************************************/

#ifndef __COMMONTOOL_H__
#define __COMMONTOOL_H__

#include <string>

namespace CommonTool
{
	/************************************************************************
	*名  称：获取可执行程序的运行路径 
	*说  明：全路径
	*参  数：无                                                                    
	*返回值：可执行程序的全路径
	************************************************************************/
	std::string GetAppPath();

	/************************************************************************
	*名  称：可执行程序的名称 
	*说  明：可执行体的名称,不包含后缀名
	*参  数：无                                                                    
	*返回值：程序名称
	************************************************************************/
	std::string GetAppName();
}

#endif